zpcaams/FieldRobot/Demo/CORTEX_M4F_STM32F407ZG-SK/User/EncoderSensor.h
/**
  ******************************************************************************
  * @file    EncoderSensor.c
  * @author  ZhouPeng
  * @version V0.1
  * @date    2013-3-22
  * @brief   This file contains all the functions prototypes for the EncoderSensor.c
  *          firmware driver.
  */ 

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __ENCODERSENSOR_H
#define __ENCODERSENSOR_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
 #include "stm32f4xx.h"
   
/* Kernel includes. */
#include "FreeRTOS.h"
#include "task.h"
#include "timers.h"
#include "semphr.h"
	 
	 
/* EncoderSensor struct */
typedef struct
{
  uint8_t Power_Mode;                         /* Power-down/Active Mode */
  uint8_t Output_DataRate;                    /* OUT data rate 100 Hz / 400 Hz */
  uint8_t Axes_Enable;                        /* Axes enable */
  uint8_t Full_Scale;                         /* Full scale */
  uint8_t Self_Test;                          /* Self test */
}EncoderSensor_InitTypeDef;

/* EncoderSensor High Pass Filter struct */
typedef struct
{
  uint8_t HighPassFilter_Data_Selection;      /* Internal filter bypassed or data from internal filter send to output register*/
  uint8_t HighPassFilter_CutOff_Frequency;    /* High pass filter cut-off frequency */
  uint8_t HighPassFilter_Interrupt;           /* High pass filter enabled for Freefall/WakeUp #1 or #2 */ 
}EncoderSensor_FilterConfigTypeDef;  

/* EncoderSensor Interrupt struct */
typedef struct
{
  uint8_t Latch_Request;                      /* Latch interrupt request into CLICK_SRC register*/
  uint8_t SingleClick_Axes;                   /* Single Click Axes Interrupts */
  uint8_t DoubleClick_Axes;                   /* Double Click Axes Interrupts */ 
}EncoderSensor_InterruptConfigTypeDef;  

/**
  * @}
  */
  
/** @defgroup STM32F4_DISCOVERY_EncoderSensor_Exported_Constants
  * @{
  */

/* Uncomment the following line to use the default EncoderSensor_TIMEOUT_UserCallback() 
   function implemented in stm32f4_discovery_EncoderSensor.c file.
   EncoderSensor_TIMEOUT_UserCallback() function is called whenever a timeout condition 
   occure during communication (waiting transmit data register empty flag(TXE)
   or waiting receive data register is not empty flag (RXNE)). */   
 #define USE_DEFAULT_TIMEOUT_CALLBACK 

/* Maximum Timeout values for flags waiting loops. These timeouts are not based
   on accurate values, they just guarantee that the application will not remain
   stuck if the SPI communication is corrupted.
   You may modify these timeout values depending on CPU frequency and application
   conditions (interrupts routines ...). */   
#define EncoderSensor_FLAG_TIMEOUT         ((uint32_t)0x1000)

/**
  * @brief  EncoderSensor SPI Interface pins
  */
#define EncoderSensor_SPI                       SPI2
#define EncoderSensor_SPI_CLK                   RCC_APB1Periph_SPI2

#define EncoderSensor_SPI_SCK_PIN               GPIO_Pin_13                  /* PB.13 */
#define EncoderSensor_SPI_SCK_GPIO_PORT         GPIOB                       /* GPIOB */
#define EncoderSensor_SPI_SCK_GPIO_CLK          RCC_AHB1Periph_GPIOB
#define EncoderSensor_SPI_SCK_SOURCE            GPIO_PinSource13
#define EncoderSensor_SPI_SCK_AF                GPIO_AF_SPI2

#define EncoderSensor_SPI_MISO_PIN              GPIO_Pin_14                  /* PB.14 */
#define EncoderSensor_SPI_MISO_GPIO_PORT        GPIOB                       /* GPIOB */
#define EncoderSensor_SPI_MISO_GPIO_CLK         RCC_AHB1Periph_GPIOB
#define EncoderSensor_SPI_MISO_SOURCE           GPIO_PinSource14
#define EncoderSensor_SPI_MISO_AF               GPIO_AF_SPI1

#define EncoderSensor_SPI_MOSI_PIN              GPIO_Pin_15                  /* PB.15 */
#define EncoderSensor_SPI_MOSI_GPIO_PORT        GPIOB                       /* GPIOB */
#define EncoderSensor_SPI_MOSI_GPIO_CLK         RCC_AHB1Periph_GPIOB
#define EncoderSensor_SPI_MOSI_SOURCE           GPIO_PinSource15
#define EncoderSensor_SPI_MOSI_AF               GPIO_AF_SPI1

#define EncoderSensor_SPI_CS_PIN                GPIO_Pin_12                  /* PB.12 */
#define EncoderSensor_SPI_CS_GPIO_PORT          GPIOB                       /* GPIOB */
#define EncoderSensor_SPI_CS_GPIO_CLK           RCC_AHB1Periph_GPIOB

// #define EncoderSensor_SPI_INT1_PIN              GPIO_Pin_0                  /* PE.00 */
// #define EncoderSensor_SPI_INT1_GPIO_PORT        GPIOE                       /* GPIOE */
// #define EncoderSensor_SPI_INT1_GPIO_CLK         RCC_AHB1Periph_GPIOE
// #define EncoderSensor_SPI_INT1_EXTI_LINE        EXTI_Line0
// #define EncoderSensor_SPI_INT1_EXTI_PORT_SOURCE EXTI_PortSourceGPIOE
// #define EncoderSensor_SPI_INT1_EXTI_PIN_SOURCE  EXTI_PinSource0
// #define EncoderSensor_SPI_INT1_EXTI_IRQn        EXTI0_IRQn 

// #define EncoderSensor_SPI_INT2_PIN              GPIO_Pin_1                  /* PE.01 */
// #define EncoderSensor_SPI_INT2_GPIO_PORT        GPIOE                       /* GPIOE */
// #define EncoderSensor_SPI_INT2_GPIO_CLK         RCC_AHB1Periph_GPIOE
// #define EncoderSensor_SPI_INT2_EXTI_LINE        EXTI_Line1
// #define EncoderSensor_SPI_INT2_EXTI_PORT_SOURCE EXTI_PortSourceGPIOE
// #define EncoderSensor_SPI_INT2_EXTI_PIN_SOURCE  EXTI_PinSource1
// #define EncoderSensor_SPI_INT2_EXTI_IRQn        EXTI1_IRQn 


/******************************************************************************/
/*************************** START REGISTER MAPPING  **************************/
/******************************************************************************/

/*******************************************************************************
*  WHO_AM_I Register: Device Identification Register
*  Read only register
*  Default value: 0x3B
*******************************************************************************/
#define EncoderSensor_WHO_AM_I_ADDR                  0x0F

/*******************************************************************************
*  CTRL_REG1 Register: Control Register 1
*  Read Write register
*  Default value: 0x07
*  7 DR: Data Rate selection.
*        0 - 100 Hz output data rate
*        1 - 400 Hz output data rate
*  6 PD: Power Down control.
*        0 - power down mode
*        1 - active mode
*  5 FS: Full Scale selection.
*        0 - Typical measurement range 2.3
*        1 - Typical measurement range 9.2
*  4:3 STP-STM Self Test Enable:
*              STP |  STM |   mode
*            ----------------------------
*               0  |  0   |   Normal mode
*               0  |  1   |   Self Test M
*               1  |  0   |   Self Test P
*  2 Zen: Z axis enable.
*         0 - Z axis disabled
*         1- Z axis enabled
*  1 Yen: Y axis enable.
*         0 - Y axis disabled
*         1- Y axis enabled
*  0 Xen: X axis enable.
*         0 - X axis disabled
*         1- X axis enabled
********************************************************************************/
#define EncoderSensor_CTRL_REG1_ADDR                 0x20

