zpcaams/FieldRobot/Demo/CORTEX_M4F_STM32F407ZG-SK/User/EncoderSensor.h
/******************************************************************************
*  CLICK_SRC Register: click status Register
*  Read only register
*  Default value: 0x00
*  7 Reserved
*  6 IA: Interrupt active.
*        0: no interrupt has been generated
*        1: one or more interrupts have been generated
*  5 Double_Z: Double click on Z axis event.
*        0: no interrupt
*        1: Double Z event has occurred 
*  4 Single_Z: Z low.
*        0: no interrupt
*        1: Single Z event has occurred 
*  3 Double_Y: Y high.
*        0: no interrupt
*        1: Double Y event has occurred 
*  2 Single_Y: Y low.
*        0: no interrupt
*        1: Single Y event has occurred 
*  1 Double_X: X high.
*        0: no interrupt
*        1: Double X event has occurred 
*  0 Single_X: X low.
*        0: no interrupt
*        1: Single X event has occurred 
*******************************************************************************/
#define EncoderSensor_CLICK_SRC_REG_ADDR        0x39

/*******************************************************************************
*  CLICK_THSY_X Register: Click threshold Y and X register
*  Read Write register
*  Default value: 0x00
*  7:4 THSy3-THSy0: Click threshold on Y axis, step 0.5g
*  3:0 THSx3-THSx0: Click threshold on X axis, step 0.5g
*******************************************************************************/
#define EncoderSensor_CLICK_THSY_X_REG_ADDR        0x3B

/*******************************************************************************
*  CLICK_THSZ Register: Click threshold Z register
*  Read Write register
*  Default value: 0x00
*  7:4 Reserved
*  3:0 THSz3-THSz0: Click threshold on Z axis, step 0.5g
*******************************************************************************/
#define EncoderSensor_CLICK_THSZ_REG_ADDR         0x3C

/*******************************************************************************
*  CLICK_TimeLimit Register: Time Limit register
*  Read Write register
*  Default value: 0x00
*  7:0 Dur7-Dur0: Time Limit value, step 0.5g
*******************************************************************************/
#define EncoderSensor_CLICK_TIMELIMIT_REG_ADDR        0x3D

/*******************************************************************************
*  CLICK_Latency Register: Latency register
*  Read Write register
*  Default value: 0x00
*  7:0 Lat7-Lat0: Latency value, step 1msec
*******************************************************************************/
#define EncoderSensor_CLICK_LATENCY_REG_ADDR        0x3E

/*******************************************************************************
*  CLICK_Window Register: Window register
*  Read Write register
*  Default value: 0x00
*  7:0 Win7-Win0: Window value, step 1msec
*******************************************************************************/
#define EncoderSensor_CLICK_WINDOW_REG_ADDR        0x3F

/******************************************************************************/
/**************************** END REGISTER MAPPING  ***************************/
/******************************************************************************/

#define EncoderSensor_SENSITIVITY_2_3G                         18  /* 18 mg/digit*/
#define EncoderSensor_SENSITIVITY_9_2G                         72  /* 72 mg/digit*/

/** @defgroup Data_Rate_selection                 
  * @{
  */
#define EncoderSensor_DATARATE_100                             ((uint8_t)0x00)
#define EncoderSensor_DATARATE_400                             ((uint8_t)0x80)
/**
  * @}
  */
  
/** @defgroup Power_Mode_selection 
  * @{
  */
#define EncoderSensor_LOWPOWERMODE_POWERDOWN                   ((uint8_t)0x00)
#define EncoderSensor_LOWPOWERMODE_ACTIVE                      ((uint8_t)0x40)
/**
  * @}
  */
  
/** @defgroup Full_Scale_selection 
  * @{
  */
#define EncoderSensor_FULLSCALE_2_3                            ((uint8_t)0x00)
#define EncoderSensor_FULLSCALE_9_2                            ((uint8_t)0x20)
/**
  * @}
  */
  
/** @defgroup Self_Test_selection 
  * @{
  */
#define EncoderSensor_SELFTEST_NORMAL                          ((uint8_t)0x00)
#define EncoderSensor_SELFTEST_P                               ((uint8_t)0x10)
#define EncoderSensor_SELFTEST_M                               ((uint8_t)0x08)
/**
  * @}
  */  

/** @defgroup Direction_XYZ_selection 
  * @{
  */
#define EncoderSensor_X_ENABLE                                 ((uint8_t)0x01)
#define EncoderSensor_Y_ENABLE                                 ((uint8_t)0x02)
#define EncoderSensor_Z_ENABLE                                 ((uint8_t)0x04)
#define EncoderSensor_XYZ_ENABLE                               ((uint8_t)0x07)
/**
  * @}
  */
 
 /** @defgroup SPI_Serial_Interface_Mode_selection 
  * @{
  */
#define EncoderSensor_SERIALINTERFACE_4WIRE                    ((uint8_t)0x00)
#define EncoderSensor_SERIALINTERFACE_3WIRE                    ((uint8_t)0x80)
/**
  * @}
  */ 

 /** @defgroup Boot_Mode_selection 
  * @{
  */
#define EncoderSensor_BOOT_NORMALMODE                          ((uint8_t)0x00)
#define EncoderSensor_BOOT_REBOOTMEMORY                        ((uint8_t)0x40)
/**
  * @}
  */   

 /** @defgroup Filtered_Data_Selection_Mode_selection 
  * @{
  */
#define EncoderSensor_FILTEREDDATASELECTION_BYPASSED           ((uint8_t)0x00)
#define EncoderSensor_FILTEREDDATASELECTION_OUTPUTREGISTER     ((uint8_t)0x20)
/**
  * @}
  */ 
  
 /** @defgroup High_Pass_Filter_Interrupt_selection 
  * @{
  */  
#define EncoderSensor_HIGHPASSFILTERINTERRUPT_OFF              ((uint8_t)0x00)
#define EncoderSensor_HIGHPASSFILTERINTERRUPT_1                ((uint8_t)0x04)
#define EncoderSensor_HIGHPASSFILTERINTERRUPT_2                ((uint8_t)0x08)
#define EncoderSensor_HIGHPASSFILTERINTERRUPT_1_2              ((uint8_t)0x0C)
/**
  * @}
  */ 
  
 /** @defgroup High_Pass_Filter_selection 
  * @{
  */
#define EncoderSensor_HIGHPASSFILTER_LEVEL_0                   ((uint8_t)0x00)
#define EncoderSensor_HIGHPASSFILTER_LEVEL_1                   ((uint8_t)0x01)
#define EncoderSensor_HIGHPASSFILTER_LEVEL_2                   ((uint8_t)0x02)
#define EncoderSensor_HIGHPASSFILTER_LEVEL_3                   ((uint8_t)0x03)
/**
  * @}
  */


/** @defgroup latch_Interrupt_Request_selection 
  * @{
  */
#define EncoderSensor_INTERRUPTREQUEST_NOTLATCHED              ((uint8_t)0x00)
#define EncoderSensor_INTERRUPTREQUEST_LATCHED                 ((uint8_t)0x40)
/**
  * @}
  */

/** @defgroup Click_Interrupt_XYZ_selection 
  * @{
  */
#define EncoderSensor_CLICKINTERRUPT_XYZ_DISABLE               ((uint8_t)0x00)
#define EncoderSensor_CLICKINTERRUPT_X_ENABLE                  ((uint8_t)0x01)
#define EncoderSensor_CLICKINTERRUPT_Y_ENABLE                  ((uint8_t)0x04)
#define EncoderSensor_CLICKINTERRUPT_Z_ENABLE                  ((uint8_t)0x10)
#define EncoderSensor_CLICKINTERRUPT_XYZ_ENABLE                ((uint8_t)0x15)
/**
  * @}
  */

/** @defgroup Double_Click_Interrupt_XYZ_selection 
  * @{
  */
#define EncoderSensor_DOUBLECLICKINTERRUPT_XYZ_DISABLE         ((uint8_t)0x00)
#define EncoderSensor_DOUBLECLICKINTERRUPT_X_ENABLE            ((uint8_t)0x02)
#define EncoderSensor_DOUBLECLICKINTERRUPT_Y_ENABLE            ((uint8_t)0x08)
#define EncoderSensor_DOUBLECLICKINTERRUPT_Z_ENABLE            ((uint8_t)0x20)
#define EncoderSensor_DOUBLECLICKINTERRUPT_XYZ_ENABLE          ((uint8_t)0x2A)
/**
  * @}
  */
/**
  * @}
  */ 
  
/** @defgroup STM32F4_DISCOVERY_EncoderSensor_Exported_Macros
  * @{
  */
#define EncoderSensor_CS_LOW()       GPIO_ResetBits(EncoderSensor_SPI_CS_GPIO_PORT, EncoderSensor_SPI_CS_PIN)
#define EncoderSensor_CS_HIGH()      GPIO_SetBits(EncoderSensor_SPI_CS_GPIO_PORT, EncoderSensor_SPI_CS_PIN)
/**
  * @}
  */ 

