zpcaams/FieldRobot/Demo/CORTEX_M4F_STM32F407ZG-SK/User/EncoderSensor.h
/** @defgroup STM32F4_DISCOVERY_EncoderSensor_Exported_Functions
  * @{
  */ 
void vEncoderSensorInitialise(void);
void vEncoderSensorRefershTask( void *pvParameters );
void EncoderSensor_InterruptConfig(EncoderSensor_InterruptConfigTypeDef *EncoderSensor_InterruptConfigStruct);
void EncoderSensor_FilterConfig(EncoderSensor_FilterConfigTypeDef *EncoderSensor_FilterConfigStruct);
void EncoderSensor_LowpowerCmd(uint8_t LowPowerMode);
void EncoderSensor_FullScaleCmd(uint8_t FS_value);
void EncoderSensor_DataRateCmd(uint8_t DataRateValue);
void EncoderSensor_RebootCmd(void);
void EncoderSensor_ReadACC(int32_t* out);
void EncoderSensor_Write(uint8_t* pBuffer, uint8_t WriteAddr, uint16_t NumByteToWrite);
void EncoderSensor_Read(uint8_t* pBuffer, uint8_t ReadAddr, uint16_t NumByteToRead);

/* USER Callbacks: This is function for which prototype only is declared in
   MEMS accelerometre driver and that should be implemented into user applicaiton. */  
/* EncoderSensor_TIMEOUT_UserCallback() function is called whenever a timeout condition 
   occure during communication (waiting transmit data register empty flag(TXE)
   or waiting receive data register is not empty flag (RXNE)).
   You can use the default timeout callback implementation by uncommenting the 
   define USE_DEFAULT_TIMEOUT_CALLBACK in stm32f4_discovery_EncoderSensor.h file.
   Typically the user implementation of this callback should reset MEMS peripheral
   and re-initialize communication or in worst case reset all the application. */
uint32_t EncoderSensor_TIMEOUT_UserCallback(void);

#ifdef __cplusplus
}
#endif

#endif /* __ENCODERSENSOR_H */
